# SetFile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImporterIFC..::..SetFile Method
ImporterIFC Class See Also
---
Sets the handle to the IFC file being created during this import operation.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetFile(
	IFCFile file
)
```

Visual Basic
---
```text
Public Sub SetFile ( _
	file As IFCFile _
)
```

Visual C++
---
```text
public:
void SetFile(
	IFCFile^ file
)
```

# ### Parameters
file
    Type: Autodesk.Revit.DB.IFC..::..IFCFile The handle to the file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace